import { IconType } from 'react-icons';
import { FaInstagram, FaFacebook } from 'react-icons/fa';

export const services = [
    {
        title: 'Пeреваги',
        link: '/#benefits'
    },
    {
        title: 'Послуги',
        list: [
            'Встановлення ГБО',
            'Ремонт ГБО',
            'Діагностика ГБО',
            'Налаштування ГБО',
            'Сертифікація',
            'Консультація'
        ]
    },
    {
        title: 'Про нас',
        link: '/#about-us'
    },
    {
        title: 'Ціни',
        link: '/#prices'
    },
    {
        title: 'FAQ',
        link: '/#faq'
    },
]

export const benefits = [
    {   
        title: 'Економія на паливі',
        description: 'Використання газу (CNG або LPG) для автомобіля значно дешевше за бензин або дизель, що дозволяє знизити витрати на паливо до 50% і більше.',
    },
    {   
        title: 'Подовження терміну служби двигуна',
        description: 'Газ згоряє чистіше, ніж бензин або дизель, що допомагає зменшити знос двигуна, зберігаючи його в кращому стані на більш довгий період.',
    },
    {   
        title: 'Вища потужність двигуна',
        description: 'Встановлення ГБО дозволяє досягти кращих характеристик роботи двигуна, оскільки газ згоряє рівномірніше і ефективніше.',
    },
    {   
        title: 'Легкість у технічному обслуговуванні',
        description: 'ГБО не потребує складного обслуговування і може бути встановлено на більшість автомобілів без серйозних змін в конструкції.',
    },
]

export const carouselImages = [
    {
        src: '/images/injectors-v2.webp',
        alt: 'Форсунки',
    },
    {
        src: '/images/lpg.webp',
        alt: 'Газові форсунки',
    },
    {
        src: '/images/installation.webp',
        alt: 'Установка ГБО',
    },
    {
        src: '/images/injectors-v2.webp',
        alt: 'Форсунки',
    },
    {
        src: '/images/lpg.webp',
        alt: 'Газові форсунки',
    },
    {
        src: '/images/installation.webp',
        alt: 'Установка ГБО',
    },
];

export const faqData = [
    {
      question: "Що таке ГБО і як воно працює?",
      answer: "ГБО (газобалонне обладнання) – це система, яка дозволяє використовувати автогаз (пропан-бутан) замість бензину. Вона складається з балону для газу, випарника, редуктора та інжекторів, що забезпечують подачу газу до двигуна."
    },
    {
      question: "Чи можна встановити ГБО на будь-який автомобіль?",
      answer: "ГБО можна встановити на більшість автомобілів, проте для старих моделей і деяких специфічних авто може знадобитися індивідуальна адаптація або перевірка сумісності."
    },
    {
      question: "Чи зменшується потужність автомобіля після встановлення ГБО?",
      answer: "Правильно налаштоване ГБО не повинно впливати на потужність автомобіля. Важливо правильно налаштувати систему для оптимальної роботи на газу."
    },
    {
      question: "Як довго служить ГБО?",
      answer: "При належному обслуговуванні і регулярному технічному огляді система ГБО може служити до 10 років або більше."
    },
    {
      question: "Як часто потрібно обслуговувати ГБО?",
      answer: "Рекомендується проводити обслуговування ГБО кожні 20 000 – 30 000 км або один раз на рік, залежно від умов експлуатації. Включає перевірку та налаштування інжекторів, редуктора і заміну фільтрів."
    },
    {
      question: "Чи є ризик для двигуна після встановлення ГБО?",
      answer: "Якщо ГБО встановлено та налаштовано правильно, ризик для двигуна мінімальний. Навпаки, газ є більш чистим паливом, що може продовжити термін служби двигуна."
    },
    {
      question: "Як вибрати ГБО для свого автомобіля?",
      answer: "Вибір ГБО залежить від типу вашого автомобіля, об'єму двигуна і ваших потреб у паливі. Найкраще звернутися до фахівців, які допоможуть підібрати оптимальне обладнання."
    },
    {
      question: "Чи можливо повертатися до використання бензину після встановлення ГБО?",
      answer: "Так, більшість систем ГБО мають можливість автоматичного переключення між газом і бензином. Ви можете використовувати бензин, коли газу немає або в разі необхідності."
    },
    {
      question: "Яка вартість встановлення ГБО?",
      answer: "Ціна залежить від марки та моделі автомобіля, а також від вибору типу ГБО. В середньому встановлення ГБО коштує від 20 000 до 40 000 грн."
    },
    {
      question: "Чи можна встановити ГБО на дизельний автомобіль?",
      answer: "Ні, ГБО призначене тільки для автомобілів з бензиновими двигунами. Для дизельних автомобілів існують інші види альтернативного палива, але вони не включають газ."
    }
  ];

  export type SocialLink = {
    label: string;
    link: string;
    icon: IconType; 
  };
  
  export const socials: SocialLink[] = [
    {
      label: 'Instagram',
      link: '#',
      icon: FaInstagram,
    },
    {
      label: 'Facebook',
      link: '#',
      icon: FaFacebook,
    },
  ];